
# 2005年 ------------------------------
df_2005 <- 
  df1 |> conv_at_once2(
    a = a[1],
    dur_month = c(7, 5),
    year = 2005
  )

# 2006--2010 ----------------------------
# 2006年から2010年は一括で処理できるので
# 初期値を調べて処理する。
df_2006_2010 <-
  conv_at_once(
    df1, 
    a = a[2:6], 
    year = 2006:2010
  )

# 2011 -------------------------
df_2011 <- 
  conv_at_once2(
    df1, 
    a = 1200, 
    year = 2011
  )

# 2012 ---------------------------
df_2012 <- 
  conv_at_once2(
    df1,
    a = 1396,
    year = 2012
  )

# 2013 --------------------------------
df_2013 <- 
  conv_at_once2(
    df1,
    a = 1592,
    dur_month = c(7, 5),
    year = 2013
  )

# 2014 ---------------------------
df_2014 <- 
  conv_at_once2(
    df1,
    a = 1788,
    dur_month = c(7, 5),
    year = 2014
  )

# 2015 -------------------------
df_2015 <- 
  conv_at_once(
    df1,
    a = 1984,
    dur_month = c(7, 5),
    year = 2015
  )

# 2016 -------------------
df_2016 <- 
  conv_at_once2(
    df1,
    a = 2180,
    year = 2016
  )

# df_all -----------------
conbini1 <- 
  list(
    df_2005,
    df_2006_2010,
    df_2011,
    df_2012,
    df_2013,
    df_2014,
    df_2015,
    df_2016
  ) |> 
  reduce(bind_rows)
